gcoonrod/stm32-shift-display/firmware/src/main.cpp
static void apply_leds(uint16_t top, uint16_t mid, uint16_t bot)
{
  if (top != led_duty[0])
  {
    led_duty[0] = top;
    analogWrite(LED_TOP, top);
  }
  if (mid != led_duty[1])
  {
    led_duty[1] = mid;
    analogWrite(LED_MID, mid);
  }
  if (bot != led_duty[2])
  {
    led_duty[2] = bot;
    analogWrite(LED_BOT, bot);
  }
}

/**
 * A smooth fade up and down, scaled so the peak is the configured brightness
 * rather than full duty -- an alarm that overrode a deliberately dim setting
 * would do so at exactly the hour that choice was made for. The trough stays
 * above zero so a glance mid-breath never reads as "not armed".
 */
static uint16_t breath_duty(uint16_t peak)
{
  // The triangle runs over 0..1023 rather than the full 12-bit range: the
  // smoothstep below squares it, and 4095 would overflow 32 bits.
  const uint32_t SPAN = 1023U;
  uint32_t half = BREATH_PERIOD_MS / 2;
  uint32_t phase = millis() % BREATH_PERIOD_MS;
  uint32_t tri = (phase < half) ? (phase * SPAN / half)
                                : ((BREATH_PERIOD_MS - phase) * SPAN / half);
  if (tri > SPAN)
  {
    tri = SPAN;
  }

  // smoothstep, t^2 * (3 - 2t), so the fade eases in and out rather than
  // reversing sharply at the extremes.
  uint32_t smooth = tri * tri * (3U * SPAN - 2U * tri) / (SPAN * SPAN);

  // Then gamma-shape it. The levels are already gamma-mapped, but the breath
  // interpolates between them and needs the same correction for the same
  // reason: equal steps of duty are not equal steps of apparent brightness, so
  // a linear fade appears to race through the dim end and crawl at the top.
  uint32_t shaped = smooth * smooth / SPAN;

  uint16_t trough = peak / 8;
  if (trough == 0)
  {
    trough = 1;
  }
  if (peak <= trough)
  {
    return peak;
  }

  return trough + (uint16_t)(((uint32_t)(peak - trough) * shaped) / SPAN);
}

// The display level in force right now, previewing an edit in progress for the
// same reason the indicators do -- and here the thing being adjusted is the very
// thing you are looking at.
static uint8_t effective_display_level()
{
  if (stateMachine.getState() == State::EDIT && edit_item == MENU_DISP)
  {
    return (edit_field[0] < DISP_LEVELS) ? edit_field[0] : (DISP_LEVELS - 1);
  }
  return (settings.displayLevel < DISP_LEVELS) ? settings.displayLevel
                                               : (DISP_LEVELS - 1);
}

void update_display_brightness()
{
  uint16_t duty = disp_gamma[effective_display_level()];
  if (duty != display.getBrightness())
  {
    display.setBrightness(duty);
  }
}

// The level in force right now: an editor in progress previews its value so the
// choice is made by eye, and backing out restores the committed setting because
// this falls straight back to it.
static uint8_t effective_indicator_level()
{
  if (stateMachine.getState() == State::EDIT && edit_item == MENU_BRIGHT)
  {
    return (edit_field[0] < LED_LEVELS) ? edit_field[0] : (LED_LEVELS - 1);
  }
  return (settings.indicatorLevel < LED_LEVELS) ? settings.indicatorLevel
                                                : (LED_LEVELS - 1);
}

void setup_user_leds()
{
  analogWrite(LED_TOP, 0);
  analogWrite(LED_MID, 0);
  analogWrite(LED_BOT, 0);
}

void setup_user_btns()
{
  pinMode(BTN_SET, INPUT_PULLUP);
  pinMode(BTN_PLUS, INPUT_PULLUP);
  pinMode(BTN_MINUS, INPUT_PULLUP);

  /**
   * PLUS and MINUS: click, and hold-to-repeat while adjusting a field.
   *
   * SET: click, and long press to back out of a level. It needs a separate
   * config because AceButton::check() evaluates long-press and repeat-press in
   * the same pass, and kLongPressDelay and kRepeatPressDelay are both 1000 ms
   * by default. Sharing one config meant a held SET emitted kEventLongPressed
   * and then kEventRepeatPressed immediately after, the latter overwriting the
   * former in the button-state latch -- so holding SET did nothing at all.
   * Keeping repeat off SET removes the collision at its source.
   *
   * kFeatureDoubleClick is deliberately not enabled anywhere: nothing uses
   * double-click and it delays every click by the double-click window.
   */
  ButtonConfig *adjustConfig = ButtonConfig::getSystemButtonConfig();
  adjustConfig->setEventHandler(handleEvent);
  adjustConfig->setFeature(ButtonConfig::kFeatureClick);
  adjustConfig->setFeature(ButtonConfig::kFeatureRepeatPress);

  setButtonConfig.setEventHandler(handleEvent);
  setButtonConfig.setFeature(ButtonConfig::kFeatureClick);
  setButtonConfig.setFeature(ButtonConfig::kFeatureLongPress);
  // Without this, releasing after a long press would also emit a click and
  // advance the field the user was trying to leave.
  setButtonConfig.setFeature(ButtonConfig::kFeatureSuppressAfterLongPress);
  btnSet.setButtonConfig(&setButtonConfig);
}

void setup_rtc()
{
  rtc.setClockSource(STM32RTC::LSE_CLOCK);
  delay(500);
  rtc.begin(false, STM32RTC::HOUR_24);

  // get date from rtc backup
  rtc.getDate(&date_time_buf.week_day, &date_time_buf.day, &date_time_buf.month, &date_time_buf.year);

  // if it is the epoch we need to reset, otherwise carry on.
  if ((date_time_buf.day == 1) && (date_time_buf.month == RTC_MONTH_JANUARY) && (date_time_buf.year == 1))
  {
    // Unix Epoch
    rtc.setHours(date_time_buf.hours);
    rtc.setMinutes(date_time_buf.minutes);
    rtc.setSeconds(date_time_buf.seconds);
    rtc.setSubSeconds(0);

    rtc.setWeekDay(date_time_buf.week_day);
    rtc.setDay(date_time_buf.day);
    rtc.setMonth(date_time_buf.month);
    rtc.setYear(date_time_buf.year);
  }

  rtc.attachSecondsInterrupt(irq_rtc_seconds);
}

void setup_usb()
{
  Serial.println(F("Shift Clock Started"));
}

void settings_load()
{
  enableBackupDomain();

  boot_magic_seen = getBackupRegister(BKP_MAGIC_REG);
  boot_flags_seen = getBackupRegister(BKP_FLAGS_REG);
  boot_alarm_seen = getBackupRegister(BKP_ALARM_REG);
  boot_bright_seen = getBackupRegister(BKP_BRIGHT_REG);

  if (boot_magic_seen != BKP_MAGIC_VALUE)
  {
    // Backup memory has never held settings (fresh coin cell, or first run of
    // this firmware). Without the magic, arbitrary contents would read as a
    // valid configuration.
    settings_save();
    return;
  }

